tap "adoptopenjdk/openjdk"
tap "apple/apple"
tap "blackmann/brew"
tap "bufbuild/buf"
tap "clojure/tools"
tap "codecrafters-io/tap"
tap "felixherrmann/tap"
tap "homebrew/services"
tap "iina/mpv-iina"
tap "kiliankoe/formulae"
tap "kubescape/tap"
tap "localazy/tools"
tap "microsoft/git"
tap "mongodb/brew"
tap "oven-sh/bun"
tap "peripheryapp/periphery"
tap "planetscale/tap"
tap "railwaycat/emacsmacport"
tap "shopify/shopify"
tap "stripe/stripe-cli"
# Run your GitHub Actions locally
brew "act"
# OpenType text shaping engine
brew "harfbuzz"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Java build tool
brew "ant"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Automatically formats Python code to conform to the PEP 8 style guide
brew "autopep8"
# Toolchain of the web
brew "biome"
# Parser generator
brew "bison"
# GNU compiler collection
brew "gcc"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Console-based Audio Visualizer for ALSA
brew "cava"
# Console Matrix
brew "cmatrix"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Tools to create, check and label file systems of the FAT family
brew "dosfstools"
# Utilities for the ext2, ext3, and ext4 file systems
brew "e2fsprogs"
# Platform built on V8 to build network applications
brew "node"
# LLVM bytecode to JavaScript compiler
brew "emscripten"
# Key value store for shared configuration and service discovery
brew "etcd"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line tools for fly.io services
brew "flyctl"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# GitHub command-line tool
brew "gh"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Image processing and image analysis library
brew "leptonica"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU implementation of time utility
brew "gnu-time"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Library for USB device access
brew "libusb"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Ping, but with a graph
brew "gping"
# Text-mode partitioning tools
brew "gptfdisk"
# Improved top (interactive process viewer)
brew "htop"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# GNOME XML library
brew "libxml2"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Powerful, lightweight programming language
brew "lua"
# Language Server for the Lua language
brew "lua-language-server"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Java-based project management
brew "maven"
# Dependency manager that installs and runs Swift command-line tool packages
brew "mint"
# Fast, highly customisable system info script
brew "neofetch"
# Incremental parsing library
brew "tree-sitter", args: ["HEAD"]
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", link: false
# Port scanning utility for large networks
brew "nmap"
# Manage multiple Node.js versions
brew "nvm"
# Command-line Git information tool
brew "onefetch"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# General-purpose scripting language
brew "php"
# Animated pipes terminal screensaver
brew "pipes-sh"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# CLI for the Pkl programming language
brew "pkl"
# Fast, disk space efficient package manager
brew "pnpm"
# Python package management tool
brew "poetry"
# Object-relational database system
brew "postgresql@14"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Implementation of Telnet and SSH
brew "putty", link: false
# Python version management
brew "pyenv"
# Static type checker for Python
brew "pyright"
# File browser
brew "ranger"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Smart session manager for the terminal
brew "sesh"
# Meta-programming for Swift, stop writing boilerplate code
brew "sourcery"
# Cross-shell prompt for astronauts
brew "starship"
# Opinionated Lua code formatter
brew "stylua"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Swift code generator for assets, storyboards, Localizable.strings, etc.
brew "swiftgen"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale"
# User interface to the TELNET protocol
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Digital clock in ncurses
brew "tty-clock"
# Collection of Linux utilities
brew "util-linux"
# Internet file retriever
brew "wget"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Additional completion definitions for zsh
brew "zsh-completions"
# The best way of working with Protocol Buffers.
brew "bufbuild/buf/buf"
# CodeCrafters CLI
brew "codecrafters-io/tap/codecrafters"
# A command-line tool to generate a JSON, PLIST, Settings.bundle or PDF file with all used SPM-dependencies of an Xcode project or workspace.
brew "felixherrmann/tap/swift-package-list"
# Check for outdated Swift package manager dependencies
brew "kiliankoe/formulae/swift-outdated"
# CLI tool for the Localazy platform
brew "localazy/tools/localazy"
# This package contains standard utilities for interacting with MongoDB.
brew "mongodb/brew/mongodb-database-tools"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# YAMAMOTO Mitsuharu's Mac port of GNU Emacs
brew "railwaycat/emacsmacport/emacs-mac@29", args: ["without-modules"]
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Tool to hide status bar icons
cask "dozer"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Control your tools with a few keystrokes
cask "raycast"
vscode "analytic-signal.preview-mp4"
vscode "arrterian.nix-env-selector"
vscode "beardedbear.beardedtheme"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "drewxs.tokyo-night-dark"
vscode "dsznajder.es7-react-js-snippets"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "glhrmoura.imports-sorter"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "jdinhlife.gruvbox"
vscode "jnoortheen.nix-ide"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "loiane.ts-extension-pack"
vscode "maosantaella.night-wolf"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "mkhl.direnv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "naumovs.color-highlight"
vscode "openai.chatgpt"
vscode "pbkit.vscode-pbkit"
vscode "pinage404.nix-extension-pack"
vscode "pkief.material-icon-theme"
vscode "pmneo.tsimporter"
vscode "prisma.prisma"
vscode "raunofreiberg.vesper"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "sainnhe.gruvbox-material"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vercel.turbo-vsc"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitaliymaz.vscode-svg-previewer"
vscode "vue.volar"
vscode "wakatime.vscode-wakatime"
vscode "xabikos.javascriptsnippets"
vscode "xyc.vscode-mdx-preview"
vscode "zeshuaro.vscode-python-poetry"
